#include <stdio.h>
int main()
{
    int year = 0;
    printf("Ця програма визначає покоління за роком народження.\n Для виходу з програми введіть -1.\n");
    while (1) // Безкінечний цикл для повторного запиту року народження
    {
        printf("Введіть рік народження: \n");
        if (scanf("%d", &year) != 1) // Якщо користувач ввів не ціле число, то результат буде 0 (хиба)
        {
            printf("Помилка: введіть коректне ціле число!\n");
            while (getchar() != '\n')
                /*Очищення відбувається настпуним шляхом: Наприклад користувач увів не число, а комбінацію
                символів abc і натиснув Enter. Буфер (те що вводе корстувач)
                виглядає так: ['a', 'b', 'c', '\n'].
                getchar() - бере рівно один символ з буфера вводу,
                та пересуває вказівник читання в буфері вперед
                Коли він доходить до натиснутого користувачем Enter,
                то умова вже не правда, і цикл завершується   */

                ; // Порожне тіло циклу, нічого не робить

            continue;
            /*Є частиною першого if, тобто якщо введення було невірним,
            то очистити буфер за допомогою внутрішнього циклу та пропустити ітерацію.
            Так як до того моменту, як цей цикл завершився
            буфер порожній, а значення year = 0, то результат буде Undeterminate, тож не має
            сенсу проводити операції порівняння */
        }
        if (year >= 1928 && year <= 1945)
        {
            printf("Покоління: Мовчуни\n Характеристика: Традиційні цінності\n");
        }
        else if (year >= 1946 && year <= 1964)
        {
            printf("Покоління: Бейбі-бумери\n Характеристика: Оптимізм, трудолюбність\n");
        }
        else if (year >= 1965 && year <= 1980)
        {
            printf("Покоління: Покоління Х\n Характеристика: Незалежність, Скептицизм\n");
        }
        else if (year >= 1981 && year <= 1996)
        {
            printf("Покоління: Y Міленіали\n Характеристика: Технічна грамотність\n");
        }
        else if (year >= 1997 && year <= 2012)
        {
            printf("Покоління: Z\n Характеристика: Цифрові аборигени, зумери\n");
        }
        else if (year >= 2013 && year <= 2025)
        {
            printf("Покоління: Альфа\n Характеристика: Повне занурення у технології\n");
        }
        else if (year == -1)
        {
            printf("Вихід з програми.\n");
            break; // Вихід з циклу, якщо користувач ввів -1
        }
        else
        {
            printf("Покоління: Невизначене\n Характеристика: Невизначене\n");
        }
    }
    return 0;
}